---
kind: property
id: P:Autodesk.Revit.DB.SlabShapeCrease.CreaseType
source: html/c8e7167e-3fdd-adf6-3290-1843adb4d82a.htm
---
# Autodesk.Revit.DB.SlabShapeCrease.CreaseType Property

The type of the crease.

## Syntax (C#)
```csharp
public SlabShapeCreaseType CreaseType { get; }
```